// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "心爱的宝贝丽斯",  // 同上...
        "今天是你的生日",
        "是我们在一起后的第二个生日",
        "也是我们在一起的第219天",
        "在一起的219天，我见过宝贝",
        "可爱的样子",
        "性感的样子",
        "霸道的样子",
        "委屈的样子",
        "温柔的样子",
        "一切都是我喜欢的样子",
        "过完生日就18岁了（确定）",
        "新的一岁里，愿宝贝",
        "贪吃不胖",
        "懒惰不丑",
        "永远健康美丽",
        "做过的美梦全部实现", 
        "每天拥有好运气",
        "愿我们",
        "长长久久",
        "一起看细水长流",
        "对不起宝贝",
        "之前包括宝贝第一个生日在内的日子",
        "都没能给宝贝带来幸福和喜悦",
        "不会谈恋爱不是理由",
        "我深刻的认识到了自己的错误",
        "未来的每一个特殊的日子",
        "以及不特殊的日子",
        "都会让宝子的生活充满仪式感和快乐",
        "会改掉错误的观念",
        "会好好珍惜宝贝",
        "宝贝上辈子是不是炸毁了银河系",
        "才遇到我",
        "我上辈子一定是拯救了银河系", 
        "才遇到了宝贝",
        "未来一定会好好珍惜宝贝",
        "好好对宝贝",
        "让宝贝也觉得上辈子是拯救的银河系",
        "宝贝不用担心我爱你的心",
        "如果真有人想要伤害宝贝",
        "我很确定他一定要先踏过我的尸体",
        "今后的日子里",
        "除去大的方面",
        "会关注每一个小的细节方面",
        "给宝贝老婆一个和鹏鹏美好的恋爱体验",
        "我爱你", 
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "送给我": "./imgs/songxinxin.jpeg",
        "也是我们在一起的第219天": "./imgs/date.jpg",
        "可爱的样子": "./imgs/keai.jpg",
        "性感的样子": "./imgs/xinggan.jpg",
        "霸道的样子": "./imgs/badao.jpg",
        "委屈的样子": "./imgs/weiqu.jpg",
        "温柔的样子": "./imgs/wenrou.jpg",
        "一切都是我喜欢的样子": "./imgs/xihuan.jpg",
        "过完生日就18岁了（确定）": "./imgs/shiba.jpeg",
        "都没能给宝贝带来幸福和喜悦": "./imgs/killmyself.jpg",
        "我深刻的认识到了自己的错误": "./imgs/gui.jpeg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "come baby",
        play: "music",
        bannar_coming: "装饰一下",
        balloons_flying: "好像少了什么",
        cake_fadein: "美味的蛋糕",
        light_candle: "点亮蜡烛许个愿吧",
        wish_message: "宝贝，生日快乐~~~",
        story: "A MESSAGE FOR MY BABY",
    },
    
    // 结束语
    loveText: '爱你的鹏鹏~'
};
